# More Practice With SQL Queries - Lab

## Introduction

In this lesson, we'll run through some practice questions to refresh our knowledge of SQL Queries!

## Objectives

You will be able to:

- Practice your SQL knowledge

## Getting Started

As in previous labs, we'll make use of the `sqlite3` library as well as `pandas`. By combining them, we'll be able to write our queries as python strings, and make sure that the results are always returned as a pandas DataFrame. 

We'll start by loading both libraries and connecting to the database we'll be using for this lab, `data.sqlite`. You may remember this database from a previous lab. As a refresher, here's the ERD diagram for this database: 

<img src='images/Database-Schema.png'>

In the cell below:

* Import the necessary libraries `pandas` and `sqlite3`
* Establish a connection to the database `data.sqlite`
* Get the `cursor` from the connection and store it in the variable `c`.

In [3]:
import pandas as pd
import sqlite3
conn = sqlite3.Connection('data.sqlite')
c = conn.cursor()

## Basic Queries

Now, let's review basic SQL queries. In the cell below:

* Write a query that gets the first name, last name, phone number, address, and credit limit for all customers in California with a credit limit greater than 25000.00.

In [4]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you
c.execute(""" 
    select *
    from sqlite_master
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
4,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
5,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
6,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."
7,table,customers,customers,33,CREATE TABLE customers (customerNumber INTEGE...

In [8]:
# For the first query, the boilerplate for getting 
#the query into a dataframe has been provided for you
c.execute(""" 
    select contactFirstName, contactLastName, phone, addressLine1, creditLimit
    from customers
    where creditLimit > 25000 and state = 'CA'
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,contactFirstName,contactLastName,phone,addressLine1,creditLimit
0,Susan,Nelson,4155551450,5677 Strong St.,210500.0
1,Julie,Murphy,6505555787,5557 North Pendale Street,64600.0
2,Juri,Hashimoto,6505556809,9408 Furth Circle,84600.0
3,Julie,Young,6265557265,78934 Hillside Dr.,90700.0
4,Valarie,Thompson,7605558146,361 Furth Circle,105000.0
5,Julie,Brown,6505551386,7734 Strong St.,105000.0
6,Brian,Chandler,2155554369,6047 Douglas Av.,57700.0
7,Sue,Frick,4085553659,3086 Ingle Ln.,77600.0
8,Steve,Thompson,3105553722,3675 Furth Circle,55400.0
9,Sue,Taylor,4155554312,2793 Furth Circle,60300.0

#### Expected Output

<img src='images/expected-output-1.png'>

## Aggregate Functions and GROUP BY

Next, write a query that get sthe average credit limit per state.

In [12]:
c.execute(""" 
    select state, avg(creditLimit) as avg_cred_lim
    from customers
    group by state
    --order by 2 desc
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

            state   avg_cred_lim
0                   61839.726027
1              BC   89950.000000
2              CA   83854.545455
3              CT   57350.000000
4        Co. Cork       0.000000
5   Isle of Wight   93900.000000
6              MA   70755.555556
7              NH  114200.000000
8              NJ   43000.000000
9             NSW  100550.000000
10             NV   71800.000000
11             NY   89966.666667
12          Osaka   81200.000000
13             PA   84766.666667
14       Pretoria       0.000000
15     Queensland   51600.000000
16         Québec   48700.000000
17          Tokyo   94400.000000
18       Victoria   88800.000000

#### Expected Output

<img src='images/expected-output-2.png'>

## JOINs

Now, write a query that uses JOIN statements to get the customer name, customer number, order number, status, and quantity ordered. Print only the head of this DataFrame.

In [36]:
c.execute(""" 
    select customerName, c.customerNumber, o.orderNumber, status, quantityOrdered, productCode
    from customers c
    left join orders o
    on c.customerNumber = o.customerNumber
    left join orderdetails d
    on o.orderNumber = d.orderNumber
    
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df.head()

,customerName,customerNumber,orderNumber,status,quantityOrdered,productCode
0,Atelier graphique,103,10123,Shipped,26,S18_1589
1,Atelier graphique,103,10123,Shipped,46,S18_2870
2,Atelier graphique,103,10123,Shipped,34,S18_3685
3,Atelier graphique,103,10123,Shipped,50,S24_1628
4,Atelier graphique,103,10298,Shipped,39,S10_2016

In [33]:
c.execute(""" 
    select *
    from products
    limit 1
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70

In [35]:
c.execute(""" 
    select *
    from orderdetails
    limit 1
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  orderNumber productCode quantityOrdered priceEach orderLineNumber
0       10100    S18_1749              30    136.00               3

#### Expected Output

<img src='images/expected-output-3.png'>

## HAVING and ORDER BY

Now, return the customerName, customrerNumber, productName, productCode and total number ordered for any product a customer has bought 10 or more of cumulatively. Sort the rows in descending order by the quantity ordered. 

**_Hint_**: For this one, you'll need to make use of HAVING, GROUP BY, and ORDER BY--make sure you get the order of them correct!

In [45]:
c.execute(""" 
    
select customerName, customerNumber, productName, productCode, count(1)
from 
    (
    select customerName, c.customerNumber, o.orderNumber, status, quantityOrdered, d.productCode, productName
    from customers c
    left join orders o
    on c.customerNumber = o.customerNumber
    left join orderdetails d
    on o.orderNumber = d.orderNumber
    left join products pr
    on d.productCode = pr.productCode
    )
group by customerName, customerNumber, productName, productCode
    
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,customerName,customerNumber,productName,productCode,count(1)
0,ANG Resellers,237,None,None,1
1,"AV Stores, Co.",187,18th Century Vintage Horse Carriage,S18_3136,1
2,"AV Stores, Co.",187,18th century schooner,S24_2011,1
3,"AV Stores, Co.",187,1903 Ford Model A,S18_3140,1
4,"AV Stores, Co.",187,1904 Buick Runabout,S18_4522,1
5,"AV Stores, Co.",187,1911 Ford Town Car,S18_2248,2
6,"AV Stores, Co.",187,1912 Ford Model T Delivery Wagon,S24_3151,1
7,"AV Stores, Co.",187,1917 Grand Touring Sedan,S18_1749,1
8,"AV Stores, Co.",187,1928 Mercedes-Benz SSK,S18_2795,2
9,"AV Stores, Co.",187,1932 Alfa Romeo 8C2300 Spider Sport,S18_4409,2
10,"AV Stores, Co.",187,1932 Model A Ford J-Coupe,S18_2325,2
11,"AV Stores, Co.",187,1934 Ford V8 Coupe,S18_2957,1
12,"AV Stores, Co.",187,1936 Mercedes Benz 500k Roadster,S24_3969,2
13,"AV Stores, Co.",187,1936 Mercedes-Benz 500K Special Roadster,S18_1367,1
14,"AV Stores, Co.",187,1937 Lincoln Berline,S18_1342,1
15,"AV Stores, Co.",187,1938 Cadillac V-16 Presidential Limousine,S24_2022,2
16,"AV Stores, Co.",187,1939 Chevrolet Deluxe Coupe,S24_1937,2
17,"AV Stores, Co.",187,1949 Jaguar XK 120,S24_2766,2
18,"AV Stores, Co.",187,1950's Chicago Surface Lines Streetcar,S32_3207,1
19,"AV Stores, Co.",187,1952 Citroen-15CV,S24_2887,2
20,"AV Stores, Co.",187,1957 Ford Thunderbird,S18_4933,2
21,"AV Stores, Co.",187,1962 City of Detroit Streetcar,S50_1514,1
22,"AV Stores, Co.",187,1965 Aston Martin DB5,S18_1589,1
23,"AV Stores, Co.",187,1966 Shelby Cobra 427 S/C,S24_1628,2
24,"AV Stores, Co.",187,1969 Chevrolet Camaro Z28,S24_3191,2
25,"AV Stores, Co.",187,1969 Corvair Monza,S12_3148,1
26,"AV Stores, Co.",187,1969 Ford Falcon,S12_3891,1
27,"AV Stores, Co.",187,1970 Chevy Chevelle SS 454,S24_1046,2
28,"AV Stores, Co.",187,1970 Triumph Spitfire,S18_4027,1
29,"AV Stores, Co.",187,2001 Ferrari Enzo,S12_1108,1
...,...,...,...,...,...
2526,West Coast Collectables Co.,475,1940 Ford Pickup Truck,S18_1097,1
2527,West Coast Collectables Co.,475,1952 Alpine Renault 1300,S10_1949,1
2528,West Coast Collectables Co.,475,American Airlines: B767-300,S700_1691,1
2529,West Coast Collectables Co.,475,F/A 18 Hornet 1/72,S700_3167,1
2530,giftsbymail.co.uk,240,18th century schooner,S24_2011,1
2531,giftsbymail.co.uk,240,1900s Vintage Bi-Plane,S24_2841,1
2532,giftsbymail.co.uk,240,1903 Ford Model A,S18_3140,1
2533,giftsbymail.co.uk,240,1904 Buick Runabout,S18_4522,1
2534,giftsbymail.co.uk,240,1928 British Royal Navy Airplane,S24_1785,1
2535,giftsbymail.co.uk,240,1928 Ford Phaeton Deluxe,S32_4289,1
2536,giftsbymail.co.uk,240,1930 Buick Marquette Phaeton,S50_1341,1
2537,giftsbymail.co.uk,240,1937 Horch 930V Limousine,S24_3420,1
2538,giftsbymail.co.uk,240,1940 Ford Delivery Sedan,S24_3816,1
2539,giftsbymail.co.uk,240,1941 Chevrolet Special Deluxe Cabriolet,S18_3856,1
2540,giftsbymail.co.uk,240,1972 Alfa Romeo GTA,S10_4757,1
2541,giftsbymail.co.uk,240,1980s Black Hawk Helicopter,S18_1662,1
2542,giftsbymail.co.uk,240,1999 Yamaha Speed Boat,S18_3029,1
2543,giftsbymail.co.uk,240,America West Airlines B757-200,S700_2466,1
2544,giftsbymail.co.uk,240,American Airlines: B767-300,S700_1691,1
2545,giftsbymail.co.uk,240,American Airlines: MD-11S,S700_4002,1
2546,giftsbymail.co.uk,240,Boeing X-32A JSF,S72_1253,1
2547,giftsbymail.co.uk,240,Collectable Wooden Train,S18_3259,1
2548,giftsbymail.co.uk,240,Corsair F4U ( Bird Cage),S24_3949,1
2549,giftsbymail.co.uk,240,F/A 18 Hornet 1/72,S700_3167,1
2550,giftsbymail.co.uk,240,HMS Bounty,S700_2047,1
2551,giftsbymail.co.uk,240,Pont Yacht,S72_3212,1
2552,giftsbymail.co.uk,240,The Mayflower,S700_1938,1
2553,giftsbymail.co.uk,240,The Queen Mary,S700_3962,1
2554,giftsbymail.co.uk,240,The Titanic,S700_3505,1
2555,giftsbymail.co.uk,240,The USS Constitution Ship,S700_2610,1

In [32]:
c.execute(""" 
    select *
    from customers c
    join orders o
    on c.customerNumber = o.customerNumber
    limit 1
;""")
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,363,Online Diecast Creations Co.,Young,Dorothy,6035558647,2304 Long Airport Avenue,,Nashua,NH,62005,USA,1216,114200.0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363

#### Expected Output

<img src='images/expected-output-4.png'>

## Subqueries

Finally, get the first name, last name, employee number, and office code for employees from an office with less than 5 employees.

#### Expected Output

<img src='images/expected-output-5.png'>

# Summary

In this lesson, we reviewed all the major concepts and keywords associated with SQL queries!